app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("created_at", "end_time", "start_time", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-06 21:33:04.259169"], ["end_time", "2000-01-01 21:00:00.000000"], ["start_time", "2000-01-01 15:00:00.000000"], ["updated_at", "2014-10-06 21:33:04.259169"]]
---
  def create
    @appointment = Appointment.new(appointment_params)

    if @appointment.save

SELECT  "appointments".* FROM "appointments"  WHERE "appointments"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_appointment
      @appointment = Appointment.find(params[:id])