app/controllers/therapists_controller.rb

SELECT  "therapists".* FROM "therapists"  WHERE "therapists"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_therapist
      @therapist = Therapist.find(params[:id])